// цикл - for

const totalPage = 10;
//for(початкове-значення; умова-продовження; зміна-лічільника
//           0                          1                 3
for (let currentPage = 1; currentPage <= totalPage; currentPage++) {
  //тіло циклу
  //                          2
  console.log("currentPage:>> " + currentPage);
}

//0 - ініціалізація лічільника, виконується один раз до циклу
//1 - продовження циклу. Якщо умова істина, то виконується тіло циклу 2, інакше вихід
//2 - тіло циклу, виконується, якщо умова 1 істина
//3 - зміна лічільника, виконується після кожної ітерації. Перехід на 1

for (let i = 1; i <= 20; i++) {
  console.log("i " + i);
}

//Задача
//Вивести парні числа від 10 до 20
for (let i = 10; i <= 20; i = i + 2) {
  console.log("i >> " + i);
}

//Задача
//Вивести парні числа від 10, 20, 30, 40... 100
for (let i = 10; i <= 100; i = i + 10) {
  console.log("i >> " + i);
}

//Задача
//Вивести віс числа від 5 до -5 з інтрвалом 0.5
// 5, 4.5, 4, 3.5, 3...0, -0.5, -1, -1.5....-4, -4.5, -5
for (let i = 5; i >= -5; i = i - 0.5) {
  console.log("i >> " + i);
}

//Задача
//Знайти середнє арифметичне непарних чисел від 3 до 11
//тоєст середнє арифметичне скласти всі непарні числа 3+5+7+9+11= суму поділити на 5
// 3+5+7+9+11 = 35 / 5 = 7

let sum = 0;
debugger; // дивитися скрипт
for (let i = 3; i <= 11; i = i + 2) {
   //локальна(блочна) область видимості
  sum = sum + i;
}
console.log("avg " + sum / 5);

//Області видимості
//Global - глобальні
//Stript - скрипт
//Block - блок
//Global > Stript > Block


//Задаача
//Порахувати добуток чисел від -5 до 10

let mult = 0;
for (let i = -5; i <= 10; i = i + 1) {
  mult = mult * i;
}
console.log(mult);


