// задача
// Порахувати суму чисел від 1 до 20
// 1 2 3 4 5 6 7 8 9 ...

//Рішення
 let i = 1; // лічильник
 let sum = 0; //коробочка куди ми сумуємо числа

 while(i <= 20)
  {
    sum = sum + i;
    i++;
    console.log(i);
 }
 console.log(sum);

 // Роз'яснення
 // i = 1 , 1 <= 20 - true
 // sum = 0 + 1 = 1
 // i++;// i = i + 1, це 1 + 1 = 2
 // i = 2 , 2 <= 20 - true
 // sum = 1 + 2 = 3
 //  i++;// i = i + 1, це 2 + 1 = 3
 //...
 //...
 //...
 // i = 20 , 20 <= 20 - true
 // sum = 190 + 20 = 210
 // i++;// i = 20 + 1, це 20 + 1 = 21
  // i = 21 , 21 <= 20 - fals



  // задача 2
// Порахувати добуток чисел від 1 до 10
 let x = 1; // лічильник
 let mult = 1; //коробочка куди ми помножуємо числа

 while(x <= 10){
    mult = mult * x;
    x++;
    console.log(x);
 }
 console.log(mult)

